cfd/V01_fan/archive_placeholder/0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.00375;
boundaryField
{
    // Turbulence inlet values: 5% intensity, length scale 0.07 * Dh (0.6462 m).
    // Same ASSUMPTION as V00. Real inlet turbulence conditions are UNKNOWN.
    AIR_INLET { type inletOutlet; inletValue uniform 0.00375; value uniform 0.00375; }
    AIR_OUTLET { type inletOutlet; inletValue uniform 0.00375; value uniform 0.00375; }
    WALLS { type kqRWallFunction; value uniform 0.00375; }
}
